Dataset/Advanced/Double_Square_SA/GT_Files/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 | OpenFOAM: The Open Source CFD Toolbox           |
| \\      /  F ield         | Version:  v12                                   |
|  \\    /   O peration     | https://openfoam.org                           |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
// bottom layer (z = -0.5)
    (0.0 0.0 -0.5) //  0
    (1.0 0.0 -0.5) //  1
    (2.0 0.0 -0.5) //  2
    (3.0 0.0 -0.5) //  3
    (4.0 0.0 -0.5) //  4
    (5.0 0.0 -0.5) //  5

    (0.0 0.75 -0.5) //  6
    (1.0 0.75 -0.5) //  7
    (2.0 0.75 -0.5) //  8
    (3.0 0.75 -0.5) //  9
    (4.0 0.75 -0.5) // 10
    (5.0 0.75 -0.5) // 11

    (0.0 1.75 -0.5) // 12
    (1.0 1.75 -0.5) // 13
    (2.0 1.75 -0.5) // 14
    (3.0 1.75 -0.5) // 15
    (4.0 1.75 -0.5) // 16
    (5.0 1.75 -0.5) // 17

    (0.0 2.5  -0.5) // 18
    (1.0 2.5  -0.5) // 19
    (2.0 2.5  -0.5) // 20
    (3.0 2.5  -0.5) // 21
    (4.0 2.5  -0.5) // 22
    (5.0 2.5  -0.5) // 23

// top layer (z = +0.5)
    (0.0 0.0 0.5) // 24
    (1.0 0.0 0.5) // 25
    (2.0 0.0 0.5) // 26
    (3.0 0.0 0.5) // 27
    (4.0 0.0 0.5) // 28
    (5.0 0.0 0.5) // 29

    (0.0 0.75 0.5) // 30
    (1.0 0.75 0.5) // 31
    (2.0 0.75 0.5) // 32
    (3.0 0.75 0.5) // 33
    (4.0 0.75 0.5) // 34
    (5.0 0.75 0.5) // 35

    (0.0 1.75 0.5) // 36
    (1.0 1.75 0.5) // 37
    (2.0 1.75 0.5) // 38
    (3.0 1.75 0.5) // 39
    (4.0 1.75 0.5) // 40
    (5.0 1.75 0.5) // 41

    (0.0 2.5  0.5) // 42
    (1.0 2.5  0.5) // 43
    (2.0 2.5  0.5) // 44
    (3.0 2.5  0.5) // 45
    (4.0 2.5  0.5) // 46
    (5.0 2.5  0.5) // 47
);

blocks
(
// bottom strip y ∈ [0,0.75]
    hex ( 0  1  7  6 24 25 31 30) (20 15 1) simpleGrading (1 1 1)
    hex ( 1  2  8  7 25 26 32 31) (20 15 1) simpleGrading (1 1 1)
    hex ( 2  3  9  8 26 27 33 32) (20 15 1) simpleGrading (1 1 1)
    hex ( 3  4 10  9 27 28 34 33) (20 15 1) simpleGrading (1 1 1)
    hex ( 4  5 11 10 28 29 35 34) (20 15 1) simpleGrading (1 1 1)

// middle strip y ∈ [0.75,1.75], skipping posts at ix=1 & ix=3
    hex ( 6  7 13 12 30 31 37 36) (20 20 1) simpleGrading (1 1 1)
    hex ( 8  9 15 14 32 33 39 38) (20 20 1) simpleGrading (1 1 1)
    hex (10 11 17 16 34 35 41 40) (20 20 1) simpleGrading (1 1 1)

// top strip y ∈ [1.75,2.5]
    hex (12 13 19 18 36 37 43 42) (20 15 1) simpleGrading (1 1 1)
    hex (13 14 20 19 37 38 44 43) (20 15 1) simpleGrading (1 1 1)
    hex (14 15 21 20 38 39 45 44) (20 15 1) simpleGrading (1 1 1)
    hex (15 16 22 21 39 40 46 45) (20 15 1) simpleGrading (1 1 1)
    hex (16 17 23 22 40 41 47 46) (20 15 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 6 30 24)
            (6 12 36 30)
            (12 18 42 36)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (5 11 35 29)
            (11 17 41 35)
            (17 23 47 41)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (0 1 25 24)
            (1 2 26 25)
            (2 3 27 26)
            (3 4 28 27)
            (4 5 29 28)
        );
    }
    topWall
    {
        type wall;
        faces
        (
            (18 19 43 42)
            (19 20 44 43)
            (20 21 45 44)
            (21 22 46 45)
            (22 23 47 46)
        );
    }
    posts
    {
        type wall;
        faces
        (
            // left square post at ix=1,iy=1
            (7 13 37 31)
            (8 14 38 32)
            (7 8 32 31)
            (13 14 38 37)
            // right square post at ix=3,iy=1
            (9 15 39 33)
            (10 16 40 34)
            (9 10 34 33)
            (15 16 40 39)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            // z = -0.5 faces (one per block, bottom-layer)
            (0 1 7 6)
            (1 2 8 7)
            (2 3 9 8)
            (3 4 10 9)
            (4 5 11 10)
            (6 7 13 12)
            (8 9 15 14)
            (10 11 17 16)
            (12 13 19 18)
            (13 14 20 19)
            (14 15 21 20)
            (15 16 22 21)
            (16 17 23 22)
            // z = +0.5 faces (top-layer)
            (24 25 31 30)
            (25 26 32 31)
            (26 27 33 32)
            (27 28 34 33)
            (28 29 35 34)
            (30 31 37 36)
            (32 33 39 38)
            (34 35 41 40)
            (36 37 43 42)
            (37 38 44 43)
            (38 39 45 44)
            (39 40 46 45)
            (40 41 47 46)
        );
    }
);

mergePatchPairs
(
);
