Dataset/Advanced/Double_Square_SA/GT_Files/0/nuTilda
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}

dimensions      [0 2 -1 0 0 0 0];
internalField   uniform 1e-6;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1e-6;
    }
    outlet
    {
        type            zeroGradient;
    }
    bottomWall
    {
        type            nutkWallFunction;
        value           uniform 1e-6;
    }
    topWall
    {
        type            nutkWallFunction;
        value           uniform 1e-6;
    }
    frontAndBack
    {
        type            empty;
    }
    posts   // your obstacle patch name (e.g. “cylinder” or “posts”)
    {
        type            nutkWallFunction;
        value           uniform 1e-6;
    }
}

